# VisGraphicsModel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..VisGraphicsModel Property
ParameterTypeId Class See Also
---
"V/G Overrides Model"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId VisGraphicsModel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property VisGraphicsModel As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ VisGraphicsModel {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace